[
  {
    "title": "Company Overview - Thrive Wellness",
    "content": "\nThrive Wellness is a Virtual Enterprises International (VEI) educational project for the 2025-2026 academic year.\n\nCOMPANY NAME: Thrive Wellness\nTYPE: Virtual Enterprises International Educational Project\nLOCATION: Aurora, Illinois, USA\nADDRESS: 2590 Ogden Ave, Aurora, IL 60504\nEMAIL: thrivewellness.il@veinternational.org\nWEBSITE: thrivewellness.com\n\nMISSION: At Thrive, we believe that wellness should be simple, accessible, and sustainable. Our mission is to create innovative products that empower you to live your best life while caring for the planet we all share.\n\nVISION: Revolutionizing wellness through premium, science-backed products.\n\nCOMPANY VALUES:\n- Health First: Every product is designed with your health and wellness at the forefront\n- Sustainability: Committed to reducing environmental impact through sustainable materials and practices\n- Quality: Maintaining the highest standards from sourcing to manufacturing\n- Community: Building a community of wellness-minded individuals who support and inspire each other\n- Pure & Natural: Made with the finest natural ingredients\n- Lab Tested: Rigorously tested for quality and safety\n- Customer First: Your satisfaction is our priority\n- Real Results: Proven effectiveness you can feel\n\nACHIEVEMENTS:\n- Products Available: 15+ active products\n- Products Sold: 1500+\n- Customers Served: 500+\n- Years Strong: 1\n\nThis is an educational simulation - products shown are for educational purposes within the VEI ecosystem.\n"
  },
  {
    "title": "Contact Information",
    "content": "\nTHRIVE WELLNESS CONTACT INFORMATION\n\nEMAIL: thrivewellness.il@veinternational.org\nThis is our primary contact email for all inquiries.\n\nLOCATION:\nThrive Wellness Headquarters\n2590 Ogden Ave, Aurora, IL 60504\nUnited States\n\nBUSINESS HOURS:\nMonday - Friday: 9:00 AM - 5:00 PM CST\nSaturday - Sunday: Closed\n\nRESPONSE TIME:\nWe typically respond to all inquiries within 24-48 business hours.\n\nDEPARTMENTS:\n- Sales Team (CSO Vinanya Penumadula): Product inquiries and orders\n- Marketing Team (CMO Mary Howard): Partnerships and collaborations\n- Customer Service: General questions and support\n- Accounting (CFO Lily Elsea): Billing and financial inquiries\n- Creative (CDO Hita Khandelwal): Design and branding questions\n- HR (Ethan Hsu, Munis Kodirova, Ryan Lucas): Career inquiries\n\nFor urgent matters, please email us directly at thrivewellness.il@veinternational.org\n"
  },
  {
    "title": "Leadership Team",
    "content": "\nTHRIVE WELLNESS LEADERSHIP TEAM\n\nEXECUTIVE LEADERSHIP:\n\nAlice Ho - Chief Executive Officer (CEO)\nLeading Thrive's vision with passion for wellness. Alice oversees all company operations and strategic direction.\n\nLily Elsea - Chief Financial Officer (CFO)\nOverseeing financial strategy and growth. Lily leads the Accounting department and manages all financial operations.\n\nHita Khandelwal - Chief Design Officer (CDO)\nShaping visual identity and UX. Hita leads the Creative department and is responsible for all design and branding.\n\nMacy Evans - Chief Administrative Officer (CAO)\nEnsuring operational excellence. Macy manages day-to-day operations and administrative functions.\n\nMary Howard - Chief Marketing Officer (CMO)\nDriving brand awareness. Mary leads the Marketing department and oversees all promotional activities.\n\nVinanya Penumadula - Chief Sales Officer (CSO)\nLeading sales initiatives. Vinanya heads the Sales department and manages customer relationships.\n"
  },
  {
    "title": "Department Teams",
    "content": "\nTHRIVE WELLNESS DEPARTMENTS\n\nACCOUNTING DEPARTMENT (Led by CFO Lily Elsea):\n- Ansh Jain - Financial Analyst: Crunching numbers and forecasting growth with precision\n- Siyansh Virmani - Accountant: Keeping the books balanced and the finances flowing\n- Alex Wohlfahrt - Financial Associate: Supporting financial operations with attention to detail\n\nCREATIVE DEPARTMENT (Led by CDO Hita Khandelwal):\n- Ronika Gajulapalli - Graphic Designer: Bringing bold ideas to life through stunning visuals\n- Grace Helbing - UX/UI Designer: Crafting seamless experiences that users love\n- Eshan Khan - Creative Director: Leading creative vision with innovation and style\n\nSALES DEPARTMENT (Led by CSO Vinanya Penumadula):\n- Dumitru Busuioc - Sales Representative: Building relationships and closing deals with confidence\n- Ishaan Manoor - Sales Person: Driving revenue and connecting with customers\n\nMARKETING DEPARTMENT (Led by CMO Mary Howard):\n- Reece Clavey - Marketing Specialist: Creating campaigns that resonate and convert\n- Eshanvi Sharma - Digital Marketer: Mastering social media and digital engagement\n- Carter Shaw - Content Strategist: Telling stories that captivate and inspire action\n\nHUMAN RESOURCES DEPARTMENT:\n- Ethan Hsu - HR Specialist: Nurturing talent and fostering a positive culture\n- Munis Kodirova - Talent Acquisition: Finding the best people to join our mission\n- Ryan Lucas - HR Coordinator: Keeping the team organized and supported\n\nTotal Team Members: 20 dedicated professionals\n"
  },
  {
    "title": "Water Bottles - Product Line",
    "content": "\nTHRIVE WELLNESS WATER BOTTLES\n\nTHE GLACIER (64oz)\nSKU: BO-46\nOur largest premium insulated water bottle with 64oz capacity.\n\nAVAILABLE COLORS:\n- White (BO-46) - Classic clean white\n- Frost Blue (BO-43) - Cool icy blue\n- Rudolph Red (BO-48) - Festive red (seasonal)\n- Santa Sleigh (BO-47) - Holiday special design (seasonal)\n\nFeatures:\n- 64oz capacity - perfect for all-day hydration\n- Double-wall vacuum insulation\n- Keeps drinks cold for 24+ hours\n- Keeps drinks hot for 12+ hours\n- BPA-free stainless steel construction\n- Leak-proof Ice Cap lid included\n- Wide mouth for easy filling and cleaning\n- Fits most cup holders\n- Durable powder-coated finish\n\nPerfect for: Gym enthusiasts, office workers, outdoor adventures, anyone wanting maximum hydration capacity.\n\n---\n\nTHE ICEBERG (40oz)\nSKU: BO-36\nOur most popular water bottle with perfect balance of size and portability.\n\nAVAILABLE COLORS:\n- White (BO-36) - Classic clean white\n- Frost Blue (BO-33) - Cool icy blue\n- Rudolph Red (BO-39) - Festive red (seasonal)\n- Santa's Sleigh (BO-40) - Holiday special design (seasonal)\n\nFeatures:\n- 40oz capacity - ideal for workouts and daily use\n- Double-wall vacuum insulation\n- Keeps drinks cold for 24+ hours\n- Keeps drinks hot for 12+ hours\n- BPA-free stainless steel construction\n- Leak-proof Ice Cap lid included\n- Wide mouth for easy filling\n- Fits cup holders\n- Powder-coated finish in multiple colors\n\nPerfect for: Workouts, daily hydration, students, commuters.\n\nBOTTLE CARE:\n- Dishwasher safe (top rack recommended)\n- Hand wash with warm soapy water for best results\n- Let air dry completely\n- All bottles are BPA-free and food-grade safe\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Supplements - Surge IV Electrolytes",
    "content": "\nSURGE IV ELECTROLYTES\n\nPremium electrolyte supplement for rapid hydration and peak performance.\n\nAVAILABLE FLAVORS:\n1. Blue Razzberry (SU-EL-1) - Classic blue raspberry flavor\n2. Fruit Punch (SU-EL-2) - Delicious fruit punch blend\n3. Lemonade (SU-EL-3) - Refreshing lemon flavor, perfect for summer\n4. Pina Colada (SU-EL-4) - Tropical vacation-inspired flavor\n5. Strawberry (SU-EL-5) - Sweet strawberry, one of our most popular\n6. Tropical Vibes (SU-EL-6) - Exotic tropical fruit blend\n7. Cucumber Lime (SU-EL-7) - Light and crisp, perfect for hot weather\n8. Apple Cider (SU-EL-8) - Fall-inspired warm apple notes\n\nPRODUCT DETAILS:\n- Servings: 30 per container\n- Formula: Zero sugar\n- Contains: Essential minerals (sodium, potassium, magnesium, calcium)\n- Flavoring: Natural flavors, no artificial colors\n\nBENEFITS:\n- Rapid electrolyte replenishment\n- Enhances hydration during workouts\n- Supports endurance and stamina\n- Helps prevent muscle cramps\n- Speeds up recovery time\n- Boosts energy levels naturally\n\nUSAGE: Mix one scoop with 16-20oz of water. Consume during or after exercise for optimal hydration.\n\nDIETARY INFO: Vegan-friendly, zero sugar, no artificial colors.\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Supplements - Peak Protein",
    "content": "\nPEAK PROTEIN\n\nPremium whey isolate protein powder for maximum muscle recovery and growth.\n\nAVAILABLE FLAVORS:\n1. Chocolate (SU-PR-1) - Rich chocolate flavor, our most popular\n2. Vanilla (SU-PR-2) - Classic vanilla, perfect for smoothies\n3. Pumpkin Spice (SU-PR-3) - Seasonal favorite, tastes like pumpkin pie\n\nNUTRITION FACTS (per serving):\n- Protein: 25g pure whey isolate\n- Calories: 120\n- Carbohydrates: 2g\n- Fat: 1g\n- Servings per container: 30\n\nPRODUCT FEATURES:\n- Fast-absorbing whey isolate protein\n- Mixes easily with no clumps\n- Delicious taste that's not too sweet\n- Low carb, low fat formula\n- No artificial sweeteners\n- Gluten-free\n\nBENEFITS:\n- Supports muscle growth and repair\n- Aids in post-workout recovery\n- Helps maintain lean muscle mass\n- Satisfies hunger between meals\n- Boosts daily protein intake\n\nUSAGE: Mix one scoop with 8-12oz of water or milk. Best consumed within 30 minutes after workout or as a meal replacement.\n\nDIETARY INFO: Contains milk ingredients (whey protein). Vegetarian but not vegan. Gluten-free.\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Accessories",
    "content": "\nTHRIVE WELLNESS ACCESSORIES\n\nSHAKER BALL\nSKU: O-SB\n\nEssential accessory for mixing protein shakes smoothly.\n\nFeatures:\n- Stainless steel wire whisk design\n- Fits all standard shaker bottles\n- Creates smooth, lump-free shakes every time\n- Durable construction\n- Dishwasher safe\n- Reusable and long-lasting\n\nUsage: Drop the shaker ball into your bottle with powder and liquid, then shake vigorously for 10-15 seconds. Eliminates powder clumps and mixes supplements evenly.\n\nA must-have for any supplement user!\n\n---\n\nTHE ANCHOR (Snack Compartment)\nSKU: O-AN\n\nConvenient snack storage that attaches to your water bottle.\n\nFeatures:\n- Secure screw-on attachment\n- Airtight seal keeps contents fresh\n- BPA-free food-grade plastic\n- Easy to clean\n- Compatible with most wide-mouth bottles\n- Capacity: Holds approximately 2 cups of snacks or supplements\n\nBenefits:\n- Carry snacks and hydration together\n- Perfect for pre/post-workout nutrition\n- Keeps supplements dry and accessible\n- Reduces need for extra bags\n- Great for hiking, gym, and travel\n\nThe perfect companion for your water bottle!\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Bundles - Premium Value Packages",
    "content": "\nTHRIVE WELLNESS BUNDLES\n\nALO X THRIVE BUNDLE\nSKU: SE-F-1\nPremium wellness bundle combining Alo yoga products with Thrive supplements.\n\nINCLUDES:\n- Alo Yoga Mat (premium quality)\n- Alo Yoga Blocks (set of 2)\n- Alo Resistance Bands (set of 3)\n- Peak Protein (choice of flavor)\n- Surge IV Electrolytes (choice of 2 flavors)\n- Thrive Water Bottle (40oz Iceberg)\n- Exclusive Alo x Thrive gym bag\n\nPerfect for: Yoga enthusiasts, home workout setups, fitness beginners, gift giving.\n\n---\n\nPELOTON X THRIVE BUNDLE\nSKU: SE-F-2\nOur most comprehensive fitness package.\n\nINCLUDES:\n- Peloton Bike (or Bike+)\n- Peloton All-Access Membership (3 months)\n- Peloton Cycling Shoes\n- Peloton Weights Set\n- Peak Protein (3 tubs, all flavors)\n- Surge IV Electrolytes (full flavor collection)\n- Thrive Water Bottle (64oz Glacier)\n- Thrive Shaker Ball\n- Exclusive Peloton x Thrive accessories\n\nPerfect for: Serious fitness enthusiasts, home gym setups, cycling lovers, complete wellness transformation.\n\n---\n\nFALL BUNDLE\nSKU: SE-F-3\nLimited-edition seasonal collection featuring autumn-inspired products.\n\nINCLUDES:\n- Peak Protein Pumpkin Spice (2 tubs)\n- Surge IV Apple Cider (2 containers)\n- Thrive Water Bottle (choice of size)\n- Seasonal recipe guide\n- Exclusive fall-themed accessories\n\nPerfect for: Fall season enthusiasts, pumpkin spice lovers, seasonal wellness routines, holiday gift giving.\n\nLimited availability - only available during fall season!\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Product Categories Overview",
    "content": "\nTHRIVE WELLNESS - PRODUCT CATEGORIES\n\nWATER BOTTLES:\n- The Glacier (64oz) - Our largest bottle for all-day hydration\n- The Iceberg (40oz) - Most popular, perfect balance of size and portability\n\nSURGE IV ELECTROLYTES (8 flavors):\n- Blue Razzberry, Fruit Punch, Lemonade, Pina Colada\n- Strawberry, Tropical Vibes, Cucumber Lime, Apple Cider\n\nPEAK PROTEIN (3 flavors):\n- Chocolate (most popular)\n- Vanilla\n- Pumpkin Spice (seasonal)\n\nACCESSORIES:\n- Shaker Ball - For smooth protein shakes\n- The Anchor - Snack compartment attachment\n\nBUNDLES:\n- Alo x Thrive Bundle - Yoga + wellness combo\n- Peloton x Thrive Bundle - Ultimate fitness package\n- Fall Bundle - Seasonal limited edition\n\nFor current prices, ask me about any specific product and I'll fetch the latest pricing from our database!\n"
  },
  {
    "title": "Shipping Information",
    "content": "\nTHRIVE WELLNESS SHIPPING\n\nSHIPPING OPTIONS:\n\nSTANDARD SHIPPING\n- Cost: FREE on all orders\n- Delivery Time: 5-7 business days\n- Description: Our reliable standard shipping option from our Aurora, IL facility. Orders are processed within 1-2 business days.\n\nEXPRESS SHIPPING\n- Cost: $9.99\n- Delivery Time: 2-3 business days\n- Description: Need it faster? Express shipping gets your order to you in no time from our Illinois warehouse.\n\nINTERNATIONAL SHIPPING\n- Cost: FREE on all orders\n- Delivery Time: 10-14 business days\n- Description: We now ship globally from our Aurora headquarters! International rates apply based on destination.\n\nSHIPPING HEADQUARTERS:\n2590 Ogden Ave, Aurora, IL 60504\n\nPROCESSING HOURS:\nMonday - Friday: 9AM - 5PM CST\n\nORDER PROCESSING:\nAll orders are processed at our Illinois headquarters within 1-2 business days before shipping.\n\nSHIPPING COVERAGE:\nWe ship to all 50 US states and internationally to select countries from our Aurora, IL facility.\n\nDELIVERY ISSUES:\nIf your package is lost, damaged, or hasn't arrived within the expected timeframe, please contact us at thrivewellness.il@veinternational.org\n\nHOLIDAY SHIPPING:\nDuring peak holiday seasons, shipping times may be slightly longer. We recommend ordering early to ensure timely delivery from our Aurora facility.\n\nNote: This is an educational VEI project - actual shipping is simulated within the VEI ecosystem.\n"
  },
  {
    "title": "Frequently Asked Questions (FAQ)",
    "content": "\nTHRIVE WELLNESS - FREQUENTLY ASKED QUESTIONS\n\nQ: How long does shipping take?\nA: Standard shipping takes 5-7 business days within the US. Express shipping (2-3 business days) is available at checkout for $9.99.\n\nQ: What is your return policy?\nA: Since our products are tangible wellness items, we do not accept returns. However, if you receive a damaged or defective product, please contact us immediately at thrivewellness.il@veinternational.org for a replacement.\n\nQ: Are your products BPA-free?\nA: Yes! All Thrive products are made with BPA-free, food-grade materials that are safe for everyday use.\n\nQ: How do I clean my water bottle?\nA: Our bottles are dishwasher safe (top rack). For best results, we recommend hand washing with warm soapy water and letting it air dry.\n\nQ: Do you ship internationally?\nA: Yes! We ship to all 50 US states and internationally to select countries. International shipping takes 10-14 business days.\n\nQ: What payment methods do you accept?\nA: We accept Visa, MasterCard, American Express, Discover, and other major credit and debit cards. We also support bank transfers and digital payment methods. All transactions are processed through the VEI portal.\n\nQ: Are the supplements vegan?\nA: Our Surge IV electrolytes are vegan-friendly. Peak Protein contains whey protein, which is vegetarian but not vegan. Check individual product pages for detailed ingredient information.\n\nQ: What is Thrive Wellness?\nA: Thrive Wellness is a Virtual Enterprises International (VEI) educational project. We create premium wellness products including water bottles, supplements, and accessories as part of our business education curriculum.\n\nQ: How can I contact you?\nA: Email us at thrivewellness.il@veinternational.org. We typically respond within 24-48 business hours.\n\nQ: Where are you located?\nA: Our headquarters is at 2590 Ogden Ave, Aurora, IL 60504.\n\nQ: What are your business hours?\nA: Monday - Friday, 9AM - 5PM CST.\n\nQ: Who is the CEO?\nA: Alice Ho is our Chief Executive Officer.\n\nQ: What's your most popular product?\nA: Peak Protein Chocolate and The Iceberg water bottle are customer favorites!\n\nQ: Do you offer discounts?\nA: Yes! Our bundles offer significant savings - up to $500+ off with the Peloton x Thrive Bundle.\n"
  }
]