[
  {
    "title": "Company Overview - Thrive Wellness",
    "content": "\nThrive Wellness is a Virtual Enterprises International (VEI) educational project for the 2025-2026 academic year.\n\nCOMPANY NAME: Thrive Wellness\nTYPE: Virtual Enterprises International Educational Project\nLOCATION: Aurora, Illinois, USA\nADDRESS: 2590 Ogden Ave, Aurora, IL 60504\nEMAIL: thrivewellness.il@veinternational.org\nWEBSITE: thrivewellness.com\n\nMISSION: At Thrive, we believe that wellness should be simple, accessible, and sustainable. Our mission is to create innovative products that empower you to live your best life while caring for the planet we all share.\n\nVISION: Revolutionizing wellness through premium, science-backed products.\n\nCOMPANY VALUES:\n- Health First: Every product is designed with your health and wellness at the forefront\n- Sustainability: Committed to reducing environmental impact through sustainable materials and practices\n- Quality: Maintaining the highest standards from sourcing to manufacturing\n- Community: Building a community of wellness-minded individuals who support and inspire each other\n- Pure & Natural: Made with the finest natural ingredients\n- Lab Tested: Rigorously tested for quality and safety\n- Customer First: Your satisfaction is our priority\n- Real Results: Proven effectiveness you can feel\n\nACHIEVEMENTS:\n- Products Available: 15+ active products\n- Products Sold: 1500+\n- Customers Served: 500+\n- Years Strong: 1\n\nThis is an educational simulation - products shown are for educational purposes within the VEI ecosystem.\n"
  },
  {
    "title": "Contact Information",
    "content": "\nTHRIVE WELLNESS CONTACT INFORMATION\n\nEMAIL: thrivewellness.il@veinternational.org\nThis is our primary contact email for all inquiries.\n\nLOCATION:\nThrive Wellness Headquarters\n2590 Ogden Ave, Aurora, IL 60504\nUnited States\n\nBUSINESS HOURS:\nMonday - Friday: 9:00 AM - 5:00 PM CST\nSaturday - Sunday: Closed\n\nRESPONSE TIME:\nWe typically respond to all inquiries within 24-48 business hours.\n\nDEPARTMENTS:\n- Sales Team (CSO Vinanya Penumadula): Product inquiries and orders\n- Marketing Team (CMO Mary Howard): Partnerships and collaborations\n- Customer Service: General questions and support\n- Accounting (CFO Lily Elsea): Billing and financial inquiries\n- Creative (CDO Hita Khandelwal): Design and branding questions\n- HR (Ethan Hsu, Munis Kodirova, Ryan Lucas): Career inquiries\n\nFor urgent matters, please email us directly at thrivewellness.il@veinternational.org\n"
  },
  {
    "title": "Leadership Team",
    "content": "\nTHRIVE WELLNESS LEADERSHIP TEAM\n\nEXECUTIVE LEADERSHIP:\n\nAlice Ho - Chief Executive Officer (CEO)\nLeading Thrive's vision with passion for wellness. Alice oversees all company operations and strategic direction.\n\nLily Elsea - Chief Financial Officer (CFO)\nOverseeing financial strategy and growth. Lily leads the Accounting department and manages all financial operations.\n\nHita Khandelwal - Chief Design Officer (CDO)\nShaping visual identity and UX. Hita leads the Creative department and is responsible for all design and branding.\n\nMacy Evans - Chief Administrative Officer (CAO)\nEnsuring operational excellence. Macy manages day-to-day operations and administrative functions.\n\nMary Howard - Chief Marketing Officer (CMO)\nDriving brand awareness. Mary leads the Marketing department and oversees all promotional activities.\n\nVinanya Penumadula - Chief Sales Officer (CSO)\nLeading sales initiatives. Vinanya heads the Sales department and manages customer relationships.\n"
  },
  {
    "title": "Department Teams",
    "content": "\nTHRIVE WELLNESS DEPARTMENTS\n\nACCOUNTING DEPARTMENT (Led by CFO Lily Elsea):\n- Ansh Jain - Financial Analyst: Crunching numbers and forecasting growth with precision\n- Siyansh Virmani - Accountant: Keeping the books balanced and the finances flowing\n- Alex Wohlfahrt - Financial Associate: Supporting financial operations with attention to detail\n\nCREATIVE DEPARTMENT (Led by CDO Hita Khandelwal):\n- Ronika Gajulapalli - Graphic Designer: Bringing bold ideas to life through stunning visuals\n- Grace Helbing - UX/UI Designer: Crafting seamless experiences that users love\n- Eshan Khan - Creative Director: Leading creative vision with innovation and style\n\nSALES DEPARTMENT (Led by CSO Vinanya Penumadula):\n- Dumitru Busuioc - Sales Representative: Building relationships and closing deals with confidence\n- Ishaan Manoor - Sales Person: Driving revenue and connecting with customers\n\nMARKETING DEPARTMENT (Led by CMO Mary Howard):\n- Reece Clavey - Marketing Specialist: Creating campaigns that resonate and convert\n- Eshanvi Sharma - Digital Marketer: Mastering social media and digital engagement\n- Carter Shaw - Content Strategist: Telling stories that captivate and inspire action\n\nHUMAN RESOURCES DEPARTMENT:\n- Ethan Hsu - HR Specialist: Nurturing talent and fostering a positive culture\n- Munis Kodirova - Talent Acquisition: Finding the best people to join our mission\n- Ryan Lucas - HR Coordinator: Keeping the team organized and supported\n\nTotal Team Members: 20 dedicated professionals\n"
  },
  {
    "title": "Water Bottles - Product Line",
    "content": "\nTHRIVE WELLNESS WATER BOTTLES\n\nTHE GLACIER (64oz)\nSKU: BO-46\nOur largest premium insulated water bottle with 64oz capacity.\n\nFeatures:\n- 64oz capacity - perfect for all-day hydration\n- Double-wall vacuum insulation\n- Keeps drinks cold for 24+ hours\n- Keeps drinks hot for 12+ hours\n- BPA-free stainless steel construction\n- Leak-proof Ice Cap lid included\n- Wide mouth for easy filling and cleaning\n- Fits most cup holders\n- Durable powder-coated white finish\n\nPerfect for: Gym enthusiasts, office workers, outdoor adventures, anyone wanting maximum hydration capacity.\n\n---\n\nTHE ICEBERG (40oz)\nSKU: BO-36\nOur most popular water bottle with perfect balance of size and portability.\n\nFeatures:\n- 40oz capacity - ideal for workouts and daily use\n- Double-wall vacuum insulation\n- Keeps drinks cold for 24+ hours\n- Keeps drinks hot for 12+ hours\n- BPA-free stainless steel construction\n- Leak-proof Ice Cap lid included\n- Wide mouth for easy filling\n- Fits cup holders\n- White powder-coated finish\n\nPerfect for: Workouts, daily hydration, students, commuters.\n\nBOTTLE CARE:\n- Dishwasher safe (top rack recommended)\n- Hand wash with warm soapy water for best results\n- Let air dry completely\n- All bottles are BPA-free and food-grade safe\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Supplements - Surge IV Electrolytes",
    "content": "\nSURGE IV ELECTROLYTES\n\nPremium electrolyte supplement for rapid hydration and peak performance.\n\nAVAILABLE FLAVORS:\n1. Blue Razzberry (SU-EL-1) - Classic blue raspberry flavor\n2. Fruit Punch (SU-EL-2) - Delicious fruit punch blend\n3. Lemonade (SU-EL-3) - Refreshing lemon flavor, perfect for summer\n4. Pina Colada (SU-EL-4) - Tropical vacation-inspired flavor\n5. Strawberry (SU-EL-5) - Sweet strawberry, one of our most popular\n6. Tropical Vibes (SU-EL-6) - Exotic tropical fruit blend\n7. Cucumber Lime (SU-EL-7) - Light and crisp, perfect for hot weather\n8. Apple Cider (SU-EL-8) - Fall-inspired warm apple notes\n\nPRODUCT DETAILS:\n- Servings: 30 per container\n- Formula: Zero sugar\n- Contains: Essential minerals (sodium, potassium, magnesium, calcium)\n- Flavoring: Natural flavors, no artificial colors\n\nBENEFITS:\n- Rapid electrolyte replenishment\n- Enhances hydration during workouts\n- Supports endurance and stamina\n- Helps prevent muscle cramps\n- Speeds up recovery time\n- Boosts energy levels naturally\n\nUSAGE: Mix one scoop with 16-20oz of water. Consume during or after exercise for optimal hydration.\n\nDIETARY INFO: Vegan-friendly, zero sugar, no artificial colors.\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Supplements - Peak Protein",
    "content": "\nPEAK PROTEIN\n\nPremium whey isolate protein powder for maximum muscle recovery and growth.\n\nAVAILABLE FLAVORS:\n1. Chocolate (SU-PR-1) - Rich chocolate flavor, our most popular\n2. Vanilla (SU-PR-2) - Classic vanilla, perfect for smoothies\n3. Pumpkin Spice (SU-PR-3) - Seasonal favorite, tastes like pumpkin pie\n\nNUTRITION FACTS (per serving):\n- Protein: 25g pure whey isolate\n- Calories: 120\n- Carbohydrates: 2g\n- Fat: 1g\n- Servings per container: 30\n\nPRODUCT FEATURES:\n- Fast-absorbing whey isolate protein\n- Mixes easily with no clumps\n- Delicious taste that's not too sweet\n- Low carb, low fat formula\n- No artificial sweeteners\n- Gluten-free\n\nBENEFITS:\n- Supports muscle growth and repair\n- Aids in post-workout recovery\n- Helps maintain lean muscle mass\n- Satisfies hunger between meals\n- Boosts daily protein intake\n\nUSAGE: Mix one scoop with 8-12oz of water or milk. Best consumed within 30 minutes after workout or as a meal replacement.\n\nDIETARY INFO: Contains milk ingredients (whey protein). Vegetarian but not vegan. Gluten-free.\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Accessories",
    "content": "\nTHRIVE WELLNESS ACCESSORIES\n\nSHAKER BALL\nSKU: O-SB\n\nEssential accessory for mixing protein shakes smoothly.\n\nFeatures:\n- Stainless steel wire whisk design\n- Fits all standard shaker bottles\n- Creates smooth, lump-free shakes every time\n- Durable construction\n- Dishwasher safe\n- Reusable and long-lasting\n\nUsage: Drop the shaker ball into your bottle with powder and liquid, then shake vigorously for 10-15 seconds. Eliminates powder clumps and mixes supplements evenly.\n\nA must-have for any supplement user!\n\n---\n\nTHE ANCHOR (Snack Compartment)\nSKU: O-AN\n\nConvenient snack storage that attaches to your water bottle.\n\nFeatures:\n- Secure screw-on attachment\n- Airtight seal keeps contents fresh\n- BPA-free food-grade plastic\n- Easy to clean\n- Compatible with most wide-mouth bottles\n- Capacity: Holds approximately 2 cups of snacks or supplements\n\nBenefits:\n- Carry snacks and hydration together\n- Perfect for pre/post-workout nutrition\n- Keeps supplements dry and accessible\n- Reduces need for extra bags\n- Great for hiking, gym, and travel\n\nThe perfect companion for your water bottle!\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Bundles - Premium Value Packages",
    "content": "\nTHRIVE WELLNESS BUNDLES\n\nALO X THRIVE BUNDLE\nSKU: SE-F-1\nPremium wellness bundle combining Alo yoga products with Thrive supplements.\n\nINCLUDES:\n- Alo Yoga Mat (premium quality)\n- Alo Yoga Blocks (set of 2)\n- Alo Resistance Bands (set of 3)\n- Peak Protein (choice of flavor)\n- Surge IV Electrolytes (choice of 2 flavors)\n- Thrive Water Bottle (40oz Iceberg)\n- Exclusive Alo x Thrive gym bag\n\nPerfect for: Yoga enthusiasts, home workout setups, fitness beginners, gift giving.\n\n---\n\nPELOTON X THRIVE BUNDLE\nSKU: SE-F-2\nOur most comprehensive fitness package.\n\nINCLUDES:\n- Peloton Bike (or Bike+)\n- Peloton All-Access Membership (3 months)\n- Peloton Cycling Shoes\n- Peloton Weights Set\n- Peak Protein (3 tubs, all flavors)\n- Surge IV Electrolytes (full flavor collection)\n- Thrive Water Bottle (64oz Glacier)\n- Thrive Shaker Ball\n- Exclusive Peloton x Thrive accessories\n\nPerfect for: Serious fitness enthusiasts, home gym setups, cycling lovers, complete wellness transformation.\n\n---\n\nFALL BUNDLE\nSKU: SE-F-3\nLimited-edition seasonal collection featuring autumn-inspired products.\n\nINCLUDES:\n- Peak Protein Pumpkin Spice (2 tubs)\n- Surge IV Apple Cider (2 containers)\n- Thrive Water Bottle (choice of size)\n- Seasonal recipe guide\n- Exclusive fall-themed accessories\n\nPerfect for: Fall season enthusiasts, pumpkin spice lovers, seasonal wellness routines, holiday gift giving.\n\nLimited availability - only available during fall season!\n\nNote: For current prices, the chatbot fetches live data from our database.\n"
  },
  {
    "title": "Product Categories Overview",
    "content": "\nTHRIVE WELLNESS - PRODUCT CATEGORIES\n\nWATER BOTTLES:\n- The Glacier (64oz) - Our largest bottle for all-day hydration\n- The Iceberg (40oz) - Most popular, perfect balance of size and portability\n\nSURGE IV ELECTROLYTES (8 flavors):\n- Blue Razzberry, Fruit Punch, Lemonade, Pina Colada\n- Strawberry, Tropical Vibes, Cucumber Lime, Apple Cider\n\nPEAK PROTEIN (3 flavors):\n- Chocolate (most popular)\n- Vanilla\n- Pumpkin Spice (seasonal)\n\nACCESSORIES:\n- Shaker Ball - For smooth protein shakes\n- The Anchor - Snack compartment attachment\n\nBUNDLES:\n- Alo x Thrive Bundle - Yoga + wellness combo\n- Peloton x Thrive Bundle - Ultimate fitness package\n- Fall Bundle - Seasonal limited edition\n\nFor current prices, ask me about any specific product and I'll fetch the latest pricing from our database!\n"
  },
  {
    "title": "Shipping Information",
    "content": "\nTHRIVE WELLNESS SHIPPING\n\nSHIPPING OPTIONS:\n\nSTANDARD SHIPPING\n- Cost: FREE on all orders\n- Delivery Time: 5-7 business days\n- Description: Our reliable standard shipping option from our Aurora, IL facility. Orders are processed within 1-2 business days.\n\nEXPRESS SHIPPING\n- Cost: $9.99\n- Delivery Time: 2-3 business days\n- Description: Need it faster? Express shipping gets your order to you in no time from our Illinois warehouse.\n\nINTERNATIONAL SHIPPING\n- Cost: FREE on all orders\n- Delivery Time: 10-14 business days\n- Description: We now ship globally from our Aurora headquarters! International rates apply based on destination.\n\nSHIPPING HEADQUARTERS:\n2590 Ogden Ave, Aurora, IL 60504\n\nPROCESSING HOURS:\nMonday - Friday: 9AM - 5PM CST\n\nORDER PROCESSING:\nAll orders are processed at our Illinois headquarters within 1-2 business days before shipping.\n\nSHIPPING COVERAGE:\nWe ship to all 50 US states and internationally to select countries from our Aurora, IL facility.\n\nDELIVERY ISSUES:\nIf your package is lost, damaged, or hasn't arrived within the expected timeframe, please contact us at thrivewellness.il@veinternational.org\n\nHOLIDAY SHIPPING:\nDuring peak holiday seasons, shipping times may be slightly longer. We recommend ordering early to ensure timely delivery from our Aurora facility.\n\nNote: This is an educational VEI project - actual shipping is simulated within the VEI ecosystem.\n"
  },
  {
    "title": "Frequently Asked Questions (FAQ)",
    "content": "\nTHRIVE WELLNESS - FREQUENTLY ASKED QUESTIONS\n\nQ: How long does shipping take?\nA: Standard shipping takes 5-7 business days within the US. Express shipping (2-3 business days) is available at checkout for $9.99.\n\nQ: What is your return policy?\nA: Since our products are tangible wellness items, we do not accept returns. However, if you receive a damaged or defective product, please contact us immediately at thrivewellness.il@veinternational.org for a replacement.\n\nQ: Are your products BPA-free?\nA: Yes! All Thrive products are made with BPA-free, food-grade materials that are safe for everyday use.\n\nQ: How do I clean my water bottle?\nA: Our bottles are dishwasher safe (top rack). For best results, we recommend hand washing with warm soapy water and letting it air dry.\n\nQ: Do you ship internationally?\nA: Yes! We ship to all 50 US states and internationally to select countries. International shipping takes 10-14 business days.\n\nQ: What payment methods do you accept?\nA: We accept Visa, MasterCard, American Express, Discover, and other major credit and debit cards. We also support bank transfers and digital payment methods. All transactions are processed through the VEI portal.\n\nQ: Are the supplements vegan?\nA: Our Surge IV electrolytes are vegan-friendly. Peak Protein contains whey protein, which is vegetarian but not vegan. Check individual product pages for detailed ingredient information.\n\nQ: What is Thrive Wellness?\nA: Thrive Wellness is a Virtual Enterprises International (VEI) educational project. We create premium wellness products including water bottles, supplements, and accessories as part of our business education curriculum.\n\nQ: How can I contact you?\nA: Email us at thrivewellness.il@veinternational.org. We typically respond within 24-48 business hours.\n\nQ: Where are you located?\nA: Our headquarters is at 2590 Ogden Ave, Aurora, IL 60504.\n\nQ: What are your business hours?\nA: Monday - Friday, 9AM - 5PM CST.\n\nQ: Who is the CEO?\nA: Alice Ho is our Chief Executive Officer.\n\nQ: What's your most popular product?\nA: Peak Protein Chocolate and The Iceberg water bottle are customer favorites!\n\nQ: Do you offer discounts?\nA: Yes! Our bundles offer significant savings - up to $500+ off with the Peloton x Thrive Bundle.\n"
  },
  {
    "title": "Training Document: Business Registration Submission 10-22-25",
    "content": "Wednesday, October 22, 2025\nBusiness Registr ation F orm\nFirm Contact Information\nSchool Name: Waubonsie Valley High School\nPlease select y our VE r egion:VE Midwest (IA, IL, IN, KS, MI, MN, MO, NE, ND, OH, SD,\nWI)\nFirm Name: Thrive\nCurr ent Firm Name on the Hub: Waubonsie Valley HS - Owles TBD\nEmplo yer Identification Number (PF \nCode)US019814\nDoes y our firm need an official VE \nemail addr ess?Yes\nFacilitat or Contact Information\nVE F acilitat or Name: David Owles\nVE F acilitat or Email: david_owles@ipsd.org\nFirm Information\nPlease choose one of the followingNew Firm\nNumber of emplo yees 20\nWhat is y our primar y product, pr oduct line or ser vice? \nA product line of personalized  water bottles made out of lightweight recycled metal, with their key feature \nbeing a removable divider that allows storage for multiple drinks. They are compatible with our \naccessories, additional compartments, and health supplements, including protein powders, electrolytes, \nand wellness shots. \nHow ha ve you determined that ther e is a need for this pr oduct or ser vice? \nWe have observed and surveyed students in school hallways, libraries, and gyms, and noticed a common \ntrend of seeing them struggling to carry multiple different drinks and water bottles at once. Recently on \nsocial media, there has also been rising trends in going to the gym, eating healthy, and staying healthy: this \nabundance of information can be confusing to digest at once, and users may feel intimidated, not knowing \nwhere to begin. Additionally, research conducted by the National Library of Medicine shows that 46% of \ncollege students consider their food choices unhealthy, with 62% interested in improving their lifestyle. \nThis statistic solidifies a consumer need for wellness products that can easily, effectively improve health, \nwhich we offer here at Thrive.\n1\nWhat pr oblem ar e you solving b y off ering this p roduct or ser vice?\nOur product line is solving two issues. Our range of customizable water bottles resolves the inconvenience \nof carrying multiple different drinks at once. Customers like to consume water, protein shakes, coffee, and \nenergy drinks at the same time, but do not have the space. Our additional compatible line of health \nsupplements and unique compartments streamlines the process of staying hydrated and healthy, \nresolving the confusion of navigating through different health trends. Together, our product line will help \nmotivate consumers to lead a healthier lifestyle.\nPRICE:\n32 oz Bottle with Normal Lid: $49.99 \n40 oz Bottle with Normal Lid: $64.99 \nDivider: $8.99 \nLiquid IV (6.3 g): $19.99 \nOrganic Protein Powder (2 lb): $33.99\nPLACEMEN T:Online Through a third-party distributor\nTrade Shows\nPROMO TION:Sponsorships Advertising Media\nIdentify the primar y audience(s) y our \nfirm intends t o reach thr ough its \nmark eting str ategy:Gen Z (born 1997-2012) VE Students\nExplain why this gr oup or gr oups wer e selected as ideal cust omers:\nGen Z and VE Students live busy lives, juggling school, work, and sports, with other responsibilities. \nCurrently on their social media, going to the gym and leading healthy lifestyles are popular topics that kids \nand college students are increasingly beginning to follow. However, busy students and workers do not \nhave the time to analyze the current, confusing market of health products and lifestyles; our product line \nresolves this issue. Our identified primary audience also shares the desire to consume multiple different \ndrinks at once, like water, coffee, and energy drinks, resulting in a struggle of holding them all at once. \nBecause they spend a majority of their day outside, they need a water bottle that can hold all of their \ndrinks at once. \nProvide a shor t description of y our Ideal Cust omer , including demogr aphic, geogr aphic and/or \npsychogr aphic attributes:\nOur ideal customers are both women and men who are either students or workers within the age range of \nthirteen to thirty years old, coming from a middle or upper class income. Geographically, our product \ntargets those across the United States living in urban or suburban towns. Our customers enjoy having \nmultiple drinks and want to prioritize health and/or athletics, but are ultimately very busy and unsure how \nto decipher between contradicting and convoluted health fads circulating on social media.\nFrom the industr y categories listed \nbelow , check the option(s) that best \nfit(s) y our business model. Select up \nto 5 options:Food and beverages Health and personal care\nGreen and eco-friendly\nApplication for Incorpor ation\nPlease select y our legal form of \nbusiness ownership:S Corporation\nWhy did y ou choose this type of legal form of b usiness ownership?\nAn S Corporation is ideal for a small startup that wants to gain a strong customer base concentrated in \nthe United States. This legal form of business ownership allows our firm to bypass double taxation with \n2\npass-through income, which is ideal for maximizing our net profit margin in our first few years of \noperation. Our product line, an improvement on pre-existing products, realistically may face risks of low \ndemand and customer interest. While we plan to enact marketing and sales tactics to reduce this potential \nrisk, it is essential for our shareholders to be protected by the limited liability offered by an S Corporation. \nAdditionally, when developing new products and promotions, we are primarily focused on the needs and \ntrends of the American market, which is compatible with the limited, American-based investor circle that \nan S Corporation requires. While this business model demands strict organization and eligibility \nrequirements, which may be considered a hassle, our small business size of twenty employees will reduce \nany excessive complications.\nFirm Budget Information\nInitial Firm Budget Information\nMonthly Expenses\nPayroll 74000\nYour t otal estimated pa yroll per \nemplo yee (based on P ayroll repor ted \nat left) is shown below:$3700\nI verify that the total estimated payroll per employee shown\nabove is accurate based on the payroll figures provided.\nRent 900\nUtilities 473\nInsur ance 100\nTotal Estimated Monthly Budget $75473\nOne-Time Expenses\nNew Firms: Please pr ovide cost estimates for the following one-time asset pur chases.                                  \nExisting Firms:Please pr ovide the book v alue of firm assets accor ding t o the Asset Log, as of \nprior Ma y 1\nInitial Inv entory Pur chases for \nbeginning sales:46086\nComputers 16640\nOffice F urnitur e & Fixtur es 13000\nEquipment 9000\nOffice Supplies 200\nTotal One-Time Expenses $84926\nFacilitat or Signatur e\n3"
  },
  {
    "title": "Training Document: Employee Handbook",
    "content": "Employee Handbook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTable of Contents\n\n Welcome………………………………………………….… 2\n\nJobs and Duties…………………………………………..  3\n\nWorkplace Policies………………………………………. 8\n\nEmployee Code of Conduct……………………………. 9\n\nPayroll and Performance Management………….. 10\n\nEmployee Acknowledgement………………………… 11\n\n\n\n\n\n\n\n\n\n\n\n\nWelcome\n\nDear Thrive Team Member,\n\nWe are thrilled to welcome you to Thrive! You’ve joined a company built on the profound belief that wellness isn't a luxury, but a necessity for all. Our mission is to make wellness simple for everyone.\n\nAt Thrive our slogan is wellness that works. This represents our dedication to making our products effective and easy to use in everyday life. Our goal is to give our customers noticeable improvements in their health and energy.\n\nThis Employee Handbook outlines our collective values, covers the procedures that keep us running smoothly, and details the many benefits and programs designed to support you. We want to ensure you have the clarity and structure you need to excel professionally while feeling fully supported personally.\n\nWe encourage open dialogue, self-care, and collaborative energy that respects the unique perspective and contribution each of you brings. As you dedicate your energy to our mission, we are equally committed to dedicating ours to you. We're here to give you the tools and resources you need to maintain that critical balance, so you can keep thriving.\n\nThank you for choosing to share your talent and passion with us. We are your dedicated resource for navigating your career here and look forward to seeing all that we will achieve together as we empower the world to Fuel its flow.\n\nHere’s to a journey of growth, balance, and success!\n\nWith warmth and support,\n\nYour HR department\n\n\n\n\n\n\n\nJobs & Duties\nChief Executive Officer (CEO) - Leader of firm, liaison between firm & facilitator\nCreate company goals\nProofread, correct, combine, and oversee Business Plan\nWrite Business Plan components: Letter from CEO,\nExecutive Summary, Mission Statement\nOversee all company departments, coordinate completion of monthly tasks/products\nAssist all employees, resolve conflicts, answer questions\nPlan monthly company meetings & meeting format\nAttend leadership meeting and tradeshows\nOversee trade show team and leadership\nHelp bring in business partners\nPerform ongoing evaluations of other chiefs\nOversee creation of Annual Report\nOther duties as assigned by facilitator\n\nChief Design Officer (CDO) - Member of chief leadership team, oversees Creative Services Dept.\nOversee development of corporate image\nDesign Business Plan template. Write sections relating to company logo usage, and design plan.\nEstablish usage guidelines for logo across all company documents and branded items\nOversee creation and maintenance of company website\nPerform ongoing evaluations of Creative Services Execs\nGive final approval on all promotions & communications\nAssist in development of all entries in trade show competitions, along with CMO\nAssist trade show teams with booth theme & design\nAttend leadership meetings and trade shows\nOther duties as assigned by facilitator\nCreative Services Executive - Reports directly to CDO; Works with team of 3-4 employees\nSet goals, objectives and strategies for department\nDevelop company website and schedule for regular updates\nDevelop company team drive on Google Create the product images used to fulfill orders\nCreate special event notices\nDevelop/design company logo & slogan ideas for firm\nAssist in the development of show booth materials\nDesign company letterhead\nAttend leadership conference and trade shows\nCreate & maintain product catalog—coordinate with\nMarketing Assist with writing of Department Manual, Business Plan, and Annual Report\nDevelop promotional materials w/ Marketing Dept.\nAssist in the preparation of materials for trade shows and competitive events Other duties as assigned by chiefs and facilitator\n\n\nChief Administration Officer (CAO) - Member of chief leadership team, oversees Human Resources Dept.\nManage department’s Business Plan writing of assigned sections\nCoordinate employee reminders—dress up days, celebrations, meeting dates, purchasing due dates, etc.\nDevelop corporate mission statement and identify corporate goals, objectives, and strategies\nOversee production of newsletters, calendar, bulletin boards\nDevelop employee evaluation & recognition systems\nDevelop employee motivation & team building activities\nAssist all employees, resolve conflicts, and answer questions\nPerform ongoing evaluations of HR Execs\nAttend leadership meetings and trade shows\nManage company e-mail account\nOther duties as assigned by facilitator\n\nHuman Resources Executive - Reports directly to CAO; Works with team of 2-3 employees\nSet goals, objectives and strategies for department\nCreate and oversee a process for conducting employee performance evaluations\nManage major projects, including special events and competitions\nDevelop list of firms who send us marketing materials\nDevelop monthly company newsletters\nDevelop monthly team building activities\nCreate employee database/company directory\nDevelop guidelines/procedures for company meetings\nRecord attendance for payroll and in the VEI portal\nCreate and maintain a company calendar of events\nManage the company e-mail\nAssist with writing of Department Manual, Business Plan, and Annual Report\nOther duties as assigned by chiefs and facilitator\nChief Marketing Officer (CMO) - Member of chief leadership team, oversees Marketing Dept.\nCoordinate creation of company goals w/CEO\nManage department’s Business Plan writing of assigned sections\nAttend leadership meetings and trade shows\nOversee company’s social media presence\nOversee creation of Company Marketing Plan w/ CSO\nOversee initial and ongoing development of product lines - including descriptions, pricing, sourcing, imagery, etc.\nPerform ongoing evaluations of Marketing Execs\nAssist in development of all entries in trade show competitions, along with CDO\nOther duties as assigned by facilitator\n\n\n\nMarketing Executive - Reports directly to CMO; Works with team of 3-4 employees\nSet goals, objectives and strategies for department\nDevelop marketing plan with regularly scheduled promotional activities across various media\nResearch target market—analyze and identify\nFinalize the initial product line; update throughout the year\nWrite creative product descriptions for website\nPresent product line modifications at company meetings\nAnalyze effectiveness of marketing campaigns\nAssist with design of trade show booth with team\nDevelop promotional materials w/ Creative Services Dept.\nAssist with writing of Department Manual, Business Plan, and Annual Report\nOther duties as assigned by chiefs and facilitator\nChief Financial Officer (CFO) - Member of chief leadership team, oversees Accounting Dept.\nManage department’s Business Plan writing of assigned sections\nAttend leadership meetings and trade shows\nCoordinate system for tracking sales and order processing, along with CSO\nPerform ongoing evaluations of Accounting Execs\nOversee preparation of weekly and monthly financial statements\nMonitor company bank account—payroll, payments, etc.\nAssist sales team with financial components of sales agreements\nProvide financial data for Annual Report\nOversee company payments to VEI for payroll taxes, corporate taxes, shipping costs and sales tax collected\nOversee payment of all monthly bills to VEI (rent, utilities, etc.)\nOther duties as assigned by facilitator\nAccounting Executive - Reports directly to CFO; Works with team of 3-4 employees\nSet goals, objectives and strategies for department\nCreate yearly budget, chart of accounts, financial records\nSet up payroll register/establish payroll procedures\nCoordinate payroll—create pay stubs/transfer monies\nPay bills—rent, utilities, insurance, interest, taxes, etc.\nOrganize workshops for employees—W-4, W-2, tax forms\nBuy and manage inventory from VE wholesale marketplace\nCommunicate inventory levels with Sales\nJournalize incoming payments\nPrepare weekly and monthly financial statements\nPresent financial statements at monthly meetings\nPrepare financial sections of Business Plan, Annual Report and competition submissions\nAssist with writing of Department Manual\nOther duties as assigned by chiefs and facilitator\n\n\n\n\n\n\n\n\nChief Sales Officer (CSO) - Member of chief leadership team, oversees Sales Dept.\nManage department’s Business Plan writing of assigned sections\nAttend leadership meetings and trade shows\nCoordinate system for tracking sales and order processing, along with CFO\nPerform ongoing evaluations of Sales Execs\nOversee preparation of weekly and monthly sales reports\nBring in outside partners for sales pitch presentation; secure sales contracts w/ non-VE partners\nDevelop sales agreements with other VEI firms\nOversee inventory tracking system, along with CFO\nCoordinate sales training for all employees\nOther duties as assigned by facilitator\n\nSales Executive - Reports directly to CSO; Works with team of 3-4 employees\nSet goals, objectives and strategies for department\nManage inventory levels; coordinate purchasing of inventory w/ Accounting Dept.\nConduct weekly and monthly product sales analysis\nNegotiate sales agreements with other VEI firms\nPrepare and deliver sales pitch to non-VE partners for large sales agreements\nCreate sales contracts for non-VE partners\nConduct sales training for all employees prior to in-person and online trade shows\nUpdate products listings in the Trade Show POS system\nOther duties as assigned by chiefs and facilitator\n\n\n\n\n\n\n\n\n\n\n\n\nWorkplace Policies\n\nConfidentiality and Data Production\nWe want to ensure that private information about employees, partners, and our company is well-protected. The following policy is important for our company’s reputation. \n\nExamples of confidential information are:\nEmployee Records\nData of customers and partners\nCustomer lists \nYou must:\nOnly disclose information to other employees when it's necessary and authorized\nYou must not:\nUse confidential information for your personal benefit or profit\nDisclose confidential information to anyone outside of our company\n\nHarassment\nTo build a productive workplace, we need everyone to treat others well and help them feel safe.\nHarassment is a broad term and may include seemingly harmless actions, for example:\nSabotaging someone’s work on purpose\nGossip\nSingling someone out perform tasks unrelated to their job against their will\nIf there is a conflict or you feel you are being harassed let your manager and/or Human Resources.\n\nDiscrimination\nThere will be no tolerance for discrimination against employees based on race, ethnicity, sex, religion.\n\nBathroom Policy\nFill out Securly and grab the pass to go to the restroom. Only one person should go at a time. \n\n\n\n\n\n\n\n\n\n\n\n\nEmployee Code of Conduct\nAll employees here at Thrive must maintain a professional and well-mannered mindset. For example, profanity is prohibited, attire must be school appropriate, and everyone should be ready to openly communicate and contribute to the betterment of Thrive. Everyone should be willing to consider other perspectives and resolve conflicts efficiently.\n\nLateness\nEveryone should be on time to class. After 3 occurrences of unexcused absences, disciplinary action will be taken. \n\nDress Code\nMost days casual wear will be fine, however during trade shows and other formal events business casual/professional attire will be required.\n\nWorking Hours\nIn class everyone is expected to be on task and completing work to further the success of this company. If extra work is required at home, you are expected to get that work done on your own time and be ready for class the next day.\n\nCell Phones\nAll phones should be in the phone pocket unless being used for our class (TikTok, Instagram, Remind, etc.)\n\nCorporate Email and Social Media\nEvery employee is expected to check their email each day in case of any communication. If any further communication is needed, the Remind app and Group Me will be used. Instagram and TikTok will be used to promote our company.\n\nAttendance\nEveryone is expected to be in class each day on time unless you have notified your chief and Mr. Owles ahead of time. If absences start to pill up and get out of hand, further disciplinary action will be taken.\n\n\n\n\n\n\n\n\n\n\n\n\nPayroll and Performance Management\n\nEmployee of the Month\nEach month at the end of the month the chiefs will all get together and discuss who the employee of the month was for that month. That individual will get recognized in class and on the bulletin board as well as earning a bonus.\n\nPaid Time Off (PTO)\nEach employee will receive 3 days of paid time off per semester. HR will keep track of how many days you have used. If you don’t use all 3 days of PTO first semester, your remaining days will carry over to second semester. If you don’t contact your chief ahead of time that you will be absent, that day is considered an unexcused absence and will not be used as a day of PTO.\n\nBonuses\nIf your hard work is recognized by your chief or other employees there is a chance of getting a bonus on your paycheck. \n\nEmployee Evaluations\nThroughout the course of the year there are 4 evaluations completed before that month’s company meeting. Every employee completes a self evaluation and an evaluation form for their respective chief and CEO. Chiefs will then fill out an evaluation for their executives and CEO. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEmployee Acknowledgement\n\nI confirm that I have read this handbook and agree to abide by the policies, rules, and procedures. I understand that adherence to these standards is essential for maintaining a productive and professional environment.  If I need any clarification regarding any policy, I understand that I should feel free to ask human resources. \n\n\n\nPrinted Name ___________________________________\n\nSignature______________________________________         Date       /      /"
  },
  {
    "title": "Training Document: Thrive Mission Statement",
    "content": "Mission Statement:\nHere at Thrive, our mission is to simplify wellness and guide busy high school and college students towards a healthier lifestyle."
  }
]